src/cfe/Catalogs/ДокументыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвердил</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВременныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРассмотрения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоРассмотренияПоДокументуЗВДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РешениеЦО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РешенияПоДокументамЗВДС_ЦО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗаявления_ТТС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтанцияПринявшаяЗаявление_ТТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции_ТТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоИсполненияОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагенты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стороны</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/ОбзорСпискаДокументов/Ext/Module.bsl
&ИзменениеИКонтроль("ПолучитьЗапросДляДокумента")
Функция ЦППК_ПолучитьЗапросДляДокумента(ТекущийДокумент)

	ЗапросТекст = "";

	ЗапросТекст = 
	"ВЫБРАТЬ
	|	ДокументыПредприятия.Ссылка,
	|	ДокументыПредприятия.Заголовок,
	|	ДокументыПредприятия.Содержание,
	|	ДокументыПредприятия.Сумма,
	|	ДокументыПредприятия.Валюта,
	|	ДокументыПредприятия.Контрагент,
	|	ДокументыПредприятия.СрокИсполнения,
	|	ДокументыПредприятия.НеДействует,
#Вставка
	|	ДокументыПредприятия.ЦППК_Изменен КАК ЦППК_Изменен,
#КонецВставки	
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.УчитыватьСуммуДокумента, ЛОЖЬ) КАК УчитыватьСуммуДокумента,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ВестиУчетТоваровИУслуг, ЛОЖЬ) КАК ВестиУчетТоваровИУслуг,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ВестиУчетПоКонтрагентам, ЛОЖЬ) КАК ВестиУчетПоКонтрагентам,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ВестиУчетСторон, ЛОЖЬ) КАК ВестиУчетСторон,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.УчитыватьНедействующиеДокументы, ЛОЖЬ) КАК
	|		УчитыватьНедействующиеДокументы,
#Вставка
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ЦППК_УчитыватьВноситИзменения, ЛОЖЬ) КАК
	|		ЦППК_УчитыватьВноситИзменения,
#КонецВставки
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.УчитыватьСрокДействия, ЛОЖЬ) КАК УчитыватьСрокДействия,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ИспользоватьСрокИсполнения, ЛОЖЬ) КАК ИспользоватьСрокИсполнения,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ВестиУчетПоОрганизациям, ЛОЖЬ) КАК ВестиУчетПоОрганизациям,
	|	ДокументыПредприятия.ДатаНачалаДействия,
	|	ДокументыПредприятия.ДатаОкончанияДействия,
	|	ДокументыПредприятия.ДатаСоздания КАК ДатаСоздания,
	|	ДокументыПредприятия.ДатаРегистрации КАК ДатаРегистрации,
	|	ДокументыПредприятия.ПорядокПродления,
	|	ДокументыПредприятия.Бессрочный,
	|	ДокументыПредприятия.ДополнительныеРеквизиты,
	|	ДокументыПредприятия.Товары,
	|	ДокументыПредприятия.Контрагенты,
	|	ДокументыПредприятия.Стороны,
	|	ДокументыПредприятия.СуммаНДС,
	|	ДокументыПредприятия.Организация,
	|	ЕСТЬNULL(ДанныеДокументовПредприятия.КонтрагентыДляСписков, """") КАК КонтрагентыДляСписков,
	|	ДокументыПредприятия.ВидДокумента КАК ВидДокумента,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ЯвляетсяВходящейКорреспонденцией, Неопределено) КАК
	|		ЯвляетсяВходящейКорреспонденцией,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ЯвляетсяИсходящейКорреспонденцией, Неопределено) КАК
	|		ЯвляетсяИсходящейКорреспонденцией,
	|	ЕСТЬNULL(ДокументыПредприятия.ВидДокумента.ЯвляетсяОбращениемОтГраждан, ЛОЖЬ) КАК
	|		ЯвляетсяОбращениемОтГраждан,
	|	ЕСТЬNULL(ДанныеДокументовПредприятия.ВидОбращения, ЗНАЧЕНИЕ(Перечисление.ВидыОбращенийГраждан.ПустаяСсылка))
	|		КАК ВидОбращения,
	|	ЕСТЬNULL(ДанныеДокументовПредприятия.Повторное, ЛОЖЬ) КАК Повторное,
	|	ЕСТЬNULL(ДанныеДокументовПредприятия.Дубликат, ЛОЖЬ) КАК Дубликат,
	|	ЕСТЬNULL(ДанныеДокументовПредприятия.АдресатыДляСписков, """") КАК АдресатыДляСписков
	|ИЗ
	|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДокументовПредприятия КАК ДанныеДокументовПредприятия
	|		ПО ДокументыПредприятия.Ссылка = ДанныеДокументовПредприятия.Документ
	|ГДЕ
	|	ДокументыПредприятия.Ссылка = &ТекущийДокумент";

	Возврат ЗапросТекст;

КонецФункции

&ИзменениеИКонтроль("ДобавитьВHTMLОсновныеДанныеОбзора")
Процедура ЦППК_ДобавитьВHTMLОсновныеДанныеОбзора(HTMLТекст, Выборка, КодЯзыка)

	Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда 

		ТипСвязи = Неопределено;
		Если Выборка.ЯвляетсяВходящейКорреспонденцией = Истина Тогда
			ТипСвязи = Справочники.ТипыСвязей.ПолученВОтветНа;
		ИначеЕсли Выборка.ЯвляетсяИсходящейКорреспонденцией = Истина Тогда
			ТипСвязи = Справочники.ТипыСвязей.ОтправленВОтветНа;
		КонецЕсли;

		Если ТипСвязи <> Неопределено Тогда
			ДокументыВОтветНа = СвязиОбъектов.ПолучитьСвязанныеОбъекты(Выборка.Ссылка, ТипСвязи);

			Если ДокументыВОтветНа.Количество() Тогда

				ПредставленияВОтветНа = Новый Массив;
				РеквизитыВОтветНа = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДокументыВОтветНа,
				"РегистрационныйНомер, ДатаРегистрации, Заголовок");

				Для Каждого ДокументВОтветНа Из ДокументыВОтветНа Цикл

					Если ЗначениеЗаполнено(РеквизитыВОтветНа[ДокументВОтветНа].РегистрационныйНомер) Тогда
						Представление = СтрШаблон(НСтр("ru = '%1 от %2'", КодЯзыка),
						РеквизитыВОтветНа[ДокументВОтветНа].РегистрационныйНомер,
						Формат(РеквизитыВОтветНа[ДокументВОтветНа].ДатаРегистрации, "ДФ=dd.MM.yyyy;"));
					Иначе
						Представление = РеквизитыВОтветНа[ДокументВОтветНа].Заголовок;
					КонецЕсли;
					ПредставленияВОтветНа.Добавить(Представление);

				КонецЦикла;

				Если ПредставленияВОтветНа.Количество() Тогда
					HTMLТекст = HTMLТекст + "<p>";
					ДобавитьПодпись(HTMLТекст, НСтр("ru = 'В ответ на:'", КодЯзыка));
					HTMLТекст = HTMLТекст + СтрШаблон("<b><A href=v8doc:tasks/ShowInReplyTo/%1>%2</A></b> <br>",
					ПолучитьНавигационнуюСсылку(Выборка.Ссылка),
					СтрСоединить(ПредставленияВОтветНа, "; "));
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьСвязиОбъектов") Тогда

			КраткиеСведенияОСвязях = СвязиОбъектов.КраткиеСведенияОСвязях(Выборка.Ссылка);

			Если Не ЗначениеЗаполнено(КраткиеСведенияОСвязях) Тогда	
				КраткиеСведенияОСвязях = НСтр("ru = 'Связи: не заданы'", КодЯзыка);
			КонецЕсли;	
			HTMLТекст = HTMLТекст + СтрШаблон(
			"<b><A href=v8doc:tasks/ShowLinks/%1>%2</A></b> <br>",
			ПолучитьНавигационнуюСсылку(Выборка.Ссылка),
			РаботаС_HTML.ЗаменитьСпецСимволыHTML(КраткиеСведенияОСвязях));
		КонецЕсли;

		ДатаСведений = Делопроизводство.ДатаУчетаДокумента(Выборка);

		Если ЗначениеЗаполнено(Выборка.Организация)
			И (Выборка.ВестиУчетПоОрганизациям Или Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям"))
			Тогда
			ДобавитьРеквизит(
			HTMLТекст, 
			РедакцииКонфигурацииКлиентСервер.Организация() + ":",
			Выборка.Организация,
			,
			Юрлица.ПредставлениеЮрлицаНаДату(Выборка.Организация, ДатаСведений));
		КонецЕсли;

		Если Выборка.ВестиУчетСторон Тогда
			Стороны = Выборка.Стороны.Выгрузить();

			Если Стороны.Количество() Тогда
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Стороны:'", КодЯзыка), "");
				Для Каждого СтрокаСторона Из Стороны Цикл
					Если ЗначениеЗаполнено(СтрокаСторона.Наименование) Тогда
						ДобавитьПодпись(HTMLТекст, СокрЛП(СтрокаСторона.Наименование) + ": ");
					КонецЕсли;

					ЮрлицоПредставление = Юрлица.ПредставлениеЮрлицаНаДату(СтрокаСторона.Сторона, ДатаСведений);
					ДобавитьЗначение(HTMLТекст, СтрокаСторона.Сторона, "", ЮрлицоПредставление);
					HTMLТекст = HTMLТекст + "<br>";
				КонецЦикла;	
				HTMLТекст = HTMLТекст + "<br>";
			Иначе
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Стороны: '", КодЯзыка), НСтр("ru = 'не указаны'", КодЯзыка));
			КонецЕсли;
		ИначеЕсли Выборка.ВестиУчетПоКонтрагентам Тогда 
			Контрагенты = Выборка.Контрагенты.Выгрузить();

			Если Контрагенты.Количество() > 1 Тогда 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Контрагенты:'", КодЯзыка), Выборка.КонтрагентыДляСписков);
			ИначеЕсли Контрагенты.Количество() > 0 И ЗначениеЗаполнено(Выборка.Контрагент) Тогда 
				ЮрлицоПредставление = Юрлица.ПредставлениеЮрлицаНаДату(Выборка.Контрагент, ДатаСведений);
				ПодписьКонтрагента = НСтр("ru = 'Контрагент:'", КодЯзыка);
				Если Выборка.ЯвляетсяОбращениемОтГраждан Тогда
					ПодписьКонтрагента = НСтр("ru = 'Отправитель:'", КодЯзыка);
				КонецЕсли;
				ДобавитьРеквизит(HTMLТекст, ПодписьКонтрагента, Выборка.Контрагент, "", ЮрлицоПредставление);
			Иначе 
				ДобавитьРеквизит(HTMLТекст, ПодписьКонтрагента, НСтр("ru = 'не указан'", КодЯзыка));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Если Выборка.УчитыватьСуммуДокумента Тогда
		ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма:'", КодЯзыка), 
		Формат(Выборка.Сумма, "ЧДЦ=2; ЧН=0") + " " + Строка(Выборка.Валюта));
	КонецЕсли;

	Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда 
		Если Выборка.УчитыватьСуммуДокумента Тогда 
			Если Делопроизводство.УчитыватьНДС(Выборка.Организация) Тогда 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Сумма НДС:'", КодЯзыка), Формат(Выборка.СуммаНДС, "ЧДЦ=2; ЧН=0") + " " + 
				Выборка.Валюта);
			КонецЕсли;

			Если Выборка.ВестиУчетТоваровИУслуг Тогда
				Товары = Выборка.Товары.Выгрузить();
				КоличествоПозиций = Товары.Количество();
				Если КоличествоПозиций > 0 Тогда 
					ДобавитьПодпись(HTMLТекст, НСтр("ru = 'Товары и услуги:'", КодЯзыка));
					HTMLТекст = HTMLТекст + СтрШаблон(
					"<A href=%1><B>%2</B></A><BR>",
					"v8doc:tasks/goods?ref=" + Строка(Выборка.Ссылка.УникальныйИдентификатор()),
					Формат(КоличествоПозиций, "ЧГ=") + " "
					+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(КоличествоПозиций,
					"Л = ru_RU", НСтр("ru = 'позиция,позиции,позиций,,,,,,0'", КодЯзыка)));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если Выборка.УчитыватьСрокДействия Тогда
			СрокДействияСтрока = ДелопроизводствоКлиентСервер.СформироватьПредставлениеСрокаДействия(Выборка);
			Если ЗначениеЗаполнено(СрокДействияСтрока) Тогда 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Срок действия:'", КодЯзыка), СрокДействияСтрока);
			Иначе 
				ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Срок действия:'", КодЯзыка), НСтр("ru = 'не указан'", КодЯзыка));
			КонецЕсли;
		КонецЕсли;

		Если Выборка.УчитыватьНедействующиеДокументы И Выборка.НеДействует Тогда
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Расторгнут:'", КодЯзыка), НСтр("ru = 'Да'", КодЯзыка));
		КонецЕсли;
		
#Вставка
		Если Выборка.ЦППК_УчитыватьВноситИзменения И Выборка.ЦППК_Изменен Тогда
			ДобавитьРеквизит(HTMLТекст, НСтр("ru = 'Изменен:'", КодЯзыка), НСтр("ru = 'Да'", КодЯзыка));
		КонецЕсли;
#КонецВставки

	КонецЕсли;

	Если Выборка.ИспользоватьСрокИсполнения Тогда
		Если ДелопроизводствоКлиентСервер.ЭтоИсходящийДокумент(Выборка.Ссылка) Тогда
			ИмяПоля = НСтр("ru = 'Срок ответа:'", КодЯзыка);
		Иначе 
			ИмяПоля = НСтр("ru = 'Срок исполнения:'", КодЯзыка);
		КонецЕсли;

		Если ЗначениеЗаполнено(Выборка.СрокИсполнения) Тогда 	
			ДобавитьРеквизит(HTMLТекст, ИмяПоля, Формат(Выборка.СрокИсполнения, "ДЛФ=D"));
		Иначе 
			ДобавитьРеквизит(HTMLТекст, ИмяПоля, НСтр("ru = 'не указан'", КодЯзыка));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
